app/controllers/posts_controller.rb

def update
	@post = Post.find(params[:id])
	if(@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Самая первая статья"], ["body", "Первая статья описание"], ["updated_at", "2019-01-10 21:20:31.720641"], ["id", 1]]